app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."name" ASC
---
  def index
    @drivers = Driver.all.order(name: :asc)

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def show
    @driver = Driver.all.find(params[:id])

INSERT INTO "drivers" ("name", "vin", "car_make", "car_model", "created_at", "updated_at", "is_available") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "HoDai"], ["vin", "ABC"], ["car_make", "Honda"], ["car_model", "Fiesta"], ["created_at", "2020-06-20 13:38:52.544717"], ["updated_at", "2020-06-20 13:38:52.544717"], ["is_available", "t"]]
---
  def create
    @driver = Driver.new(driver_params)
    if @driver.save

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @driver = Driver.find_by(id: params[:id])

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "drivers" SET "is_available" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["is_available", "t"], ["updated_at", "2020-06-20 09:19:51.779151"], ["id", 33]]
---
  def update
    @driver = Driver.find_by(id: params[:id])
    if !@driver.nil?
      @driver.update(driver_params) ? (redirect_to driver_path(@driver.id)) :