app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers" ORDER BY "passengers"."name" ASC
---
  def index
    @passengers = Passenger.all.order(name: :asc)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 301], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @passenger = Passenger.find(id)

INSERT INTO "passengers" ("name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ho Dai"], ["phone_num", "012423434532"], ["created_at", "2020-06-20 09:18:14.769500"], ["updated_at", "2020-06-20 09:18:14.769500"]]
---
  def create
    @passenger = Passenger.new(passenger_params)
    if @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def edit
    @passenger = Passenger.find_by(id: params[:id])

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def update
    @passenger = Passenger.find_by(id: params[:id])