app/controllers/trips_controller.rb

  def index
    @trips = Trip.all.order(id: :asc)
---
SELECT "trips".* FROM "trips" ORDER BY "trips"."id" ASC

  def show
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]

  def create
    driver = find_available_driver
    passenger = Passenger.find_by(id: params[:passenger_id])
    if !driver
      flash[:notice] = "Sorry! There are no available drivers right now."
      redirect_to passenger
    else
      @trip = Trip.new
      @trip.passenger = passenger
      @trip.driver = driver
      @trip.date = Date.today
      @trip.cost = rand(1000..3000)
      if @trip.save
---
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 301], ["LIMIT", 1]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "driver_id", "passenger_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2020-06-20"], ["cost", 1123], ["created_at", "2020-06-20 09:18:41.105384"], ["updated_at", "2020-06-20 09:18:41.105384"], ["driver_id", 86], ["passenger_id", 301]]

  def edit
    @trip = Trip.find_by(id: params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 601], ["LIMIT", 1]]

  def update
    @trip = Trip.find_by(id: params[:id])
    if !@trip.nil?
      if @trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 601], ["LIMIT", 1]]
UPDATE "trips" SET "rating" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["rating", 3], ["updated_at", "2020-06-20 09:20:16.670657"], ["id", 601]]

  def find_available_driver
    return Driver.where(is_available: true).sample
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."is_available" = $1  [["is_available", "t"]]